In [2]:
import pandas as pd
!pip install tabulate
df =  pd.DataFrame({
    'names' :['John','Eric','Alex','Kamau','Nancy'],
    'salary' : [234,122,321,432,433],
    'age' : [10,43,43,51,32],
    'weigh' : [321,123,89,76,71]
    
})
df.head()

Requirement already satisfied: tabulate in c:\users\kkama\appdata\local\anaconda3\lib\site-packages (0.9.0)

   names  salary  age  weigh
0   John     234   10    321
1   Eric     122   43    123
2   Alex     321   43     89
3  Kamau     432   51     76
4  Nancy     433   32     71

In [4]:
from pandas.io.clipboards import to_clipboard
md = df.to_markdown()
to_clipboard(md,excel = False)

|    | names   |   salary |   age |   weigh |
|---:|:--------|---------:|------:|--------:|
|  0 | John    |      234 |    10 |     321 |
|  1 | Eric    |      122 |    43 |     123 |
|  2 | Alex    |      321 |    43 |      89 |
|  3 | Kamau   |      432 |    51 |      76 |
|  4 | Nancy   |      433 |    32 |      71 |

In [6]:
df.query("names =='John'")

  names  salary  age  weigh
0  John     234   10    321